Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G34B.tmx
Source language: en_us
Languages: zh_cn

source: Andrew F. Huxley - Biography
zh_cn: 安德鲁 菲尔丁 赫胥黎简介

source: Andrew Fielding Huxley
zh_cn: 安德鲁·菲尔丁·赫胥黎

source: Born: 22 November 1917, Hampstead, United Kingdom
zh_cn: 出生:1917年11月22日，英国汉普斯特德

source: Died: 30 May 2012, Grantchester, United Kingdom
zh_cn: 去世： 2012年5月30日，英国格兰切斯特

source: Affiliation at the time of the award: University College, London, United Kingdom
zh_cn: 获奖时所在单位：英国伦敦大学学院

source: Prize motivation: "for their discoveries concerning the ionic mechanisms involved in excitation and inhibition in the peripheral and central portions of the nerve cell membrane"
zh_cn: 获奖的理由：“他们发现刺激和抑制神经细胞膜周边和中央部分所涉及的离子机制”

source: Biography
zh_cn: 简介

source: Andrew Fielding Huxley was born in Hampstead, London, on 22nd November 1917.
zh_cn: 安德鲁·菲尔丁·赫胥黎1917年11月22日出生在伦敦汉普斯特。

source: His father, Leonard Huxley, who was a son of the nineteenth - century scientist and writer Thomas Huxley, was for a time a classics master at Charterhouse School and later took up a literary career, writing a number of biographies and being editor of the ?Cornhill? magazine.
zh_cn: 他的父亲伦纳德·赫胥黎，是19世纪的科学家、作家托马斯·赫胥黎的儿子，一度是卡尔特豪斯公学的古典文学老师，后来开始了文学生涯，撰写了许多传记，成为?康希尔?杂志的主笔。

source: The children of his first marriage included Sir Julian Huxley the biologist and Aldous Huxley the writer.
zh_cn: 他第一次婚姻所生的孩子包括生物学家朱利安·赫胥黎爵士和作家奥尔德斯·赫胥黎。

source: After his first wife's death, Andrew's father married Rosalind Bruce, and Andrew is the youngest of the two sons of this marriage.
zh_cn: 他的第一任妻子去世后，安德鲁的父亲娶了罗莎琳德·布鲁斯，安德鲁是他们两个儿子中最小的一个。

source: His father died in 1933.
zh_cn: 他的父亲于1933年去世。

source: Andrew was educated at University College School (1925-1930) and Westminster School (1930-1935, King's Scholar); and went up to Trinity College, Cambridge in 1935 with a major entrance scholarship.
zh_cn: 安德鲁曾就读于英国私立中学(1925 - 1930年)，威斯敏斯特学校(1930 - 1935年，获得过英国皇家奖学金)，1935年主要靠奖学金上了剑桥大学圣三一学院。

source: He had turned over to science from classics in 1932, and went to Cambridge expecting that his career would be in the physical sciences: he has always been mechanically minded, and he was inspired at Westminster by the physics teaching of the late J. F. Rudwick.
zh_cn: 1932年，他的专业从古典文学转到自然科学，然后到剑桥大学学习，希望他的事业将在物理学领域有一番作为：他一直对力学感兴趣，早在威斯敏斯特学校，上已故的鲁德维克物理课时，就受到了很大的启发。

source: He naturally took physics, chemistry and mathematics in his Part I at Cambridge, but the rules required him to take another science and he picked physiology, largely on the recommendation of an old friend, B. Delisle Burns, now of the Physiology Department, McGill University.
zh_cn: 他自然会把物理、化学和数学的学习作为他在剑桥的重点，但规则要求他选学另一门自然科学课程，他挑选了生理学，主要是一位在麦吉尔大学生理学系学习的老朋友B·迪莱尔·伯恩斯的推荐。

source: Huxley found physiology interesting, partly for its subject matter and partly through contact with Adrian, Roughton, Rushton, Hodgkin and the late G. A. Millikan (all Fellows of Trinity) and others in the department, and he decided to specialise in it.
zh_cn: 赫胥黎发现生理学很有意思，部分是因为它的主旨，部分是通过接触艾德里安、拉夫顿、拉什顿、霍奇金和已故的密立根(他们都是圣三一学院的同学)和系里其他的人，他决定专攻它。

source: He spent 1937-1938 doing anatomy with the intention of qualifying in medicine, and 1938-1939 doing the Part II course in physiology.
zh_cn: 他在1937 - 1938做解剖学研究，以获得行医资格，1938 - 1939年学习生理学第二部分课程。

source: In August 1939 Huxley joined Hodgkin at the Marine Biological Laboratory at Plymouth for his first introduction to research, and they succeeded in recording electrically from the inside of the squid giant axon.
zh_cn: 1939年8月赫胥黎加入霍奇金在普利茅斯的海洋生物实验室，作为他的第一项入门研究，他们成功地记录了来自乌贼体内巨大的神经细胞的放电现象。

source: For the first year of the war Huxley was a clinical student, but when medical teaching in London was stopped by air attacks, he changed to work of more immediate application, and spent the rest of the war on operational research in gunnery, first for Anti-Aircraft Command and later for the Admiralty.
zh_cn: 战争的第一年，赫胥黎还是个临床的学生，但当伦敦空袭中停止了医学教学时，他立即申请参加工作，并且在接下来的战争中，进行射击方面的运筹学研究，开始为防空司令部工作，后来又到了海军部。

source: In 1941 Huxley was elected to a research fellowship at Trinity College, Cambridge, and he took this up at the beginning of 1946 together with a teaching appointment in the Department of Physiology.
zh_cn: 1941年赫胥黎在剑桥大学三一学院当选了一名学术研究员，直到1946年初，他成为生理学系的一名讲师。

source: He continued to hold college and university posts in Cambridge until 1960, when he became head of the Department of Physiology at University College London.
zh_cn: 这样他在剑桥大学工作到1960年，他就去了伦敦大学学院担任生理学系主任。

source: In 1969 he was appointed to a Royal Society Research Professorship which he holds in the Department of Physiology at University College London.
zh_cn: 1969年，他被授予伦敦大学学院生理学系英国皇家学会研究教授。

source: From 1946 to 1951 Huxley worked mostly in collaboration with Hodgkin on nerve conduction, but also with R. St?mfli on myelinated nerve fibres.
zh_cn: 从1946年到1951年，赫胥黎主要与霍奇金在神经传导研究方面进行合作，但也和斯坦利共同研究i髓神经纤维课题。

source: In 1952 he turned to muscle contraction, and developed an interference microscope for studying the striation pattern in isolated muscle fibres.
zh_cn: 1952年，他转向肌肉收缩研究，并发展了一种利用干涉显微镜研究孤立的肌肉纤维条纹图案的方法。

source: This has continued to be his main line of work up to the present, though he has done some further computations on the generation of the action potential.
zh_cn: 到现在这仍然是他的主要工作，不过他在动作电位的产生上已经做了一些更进一步的计算。

source: Huxley has also developed a microtome for electron microscope sections, and a micromanipulator.
zh_cn: 赫胥黎还开发了一个电子显微镜切片研究的超薄切片机，以及一台显微操作器。

source: Huxley was an Editor of the Journal of Physiology from 1950-1957, he has also been an Editor of the Journal of Molecular Biology.
zh_cn: 1950年至1957年期间赫胥黎负责《生理学期刊》的编辑工作，同时他还负责编辑《分子生物学期刊》。

source: He became a Fellow of the Royal Society in 1955, and served on its Council, 1960-1962.
zh_cn: 1955年他成为皇家学会的一员，1960 - 1962在其理事会任职。
